////계수정렬
////범위 조건이있을때 매우 빠른정렬 알고리즘
////크기를 기준으로 갯수를 세는방법
//#include<iostream>
//using namespace std;
//
//// 주어진 5이하의 자연수 데이터를 오름차순 정렬하는 문제
//int main() {
//	int temp;
//	int count[5] = { 0 };
//
//	// 정렬할 자연수 데이터들 
//	int arr[30] = {
//		1, 3, 2, 4, 3, 2, 5, 3, 1, 2,
//		3, 4, 4, 3, 5, 1, 2, 3, 5, 2,
//		3, 1, 4, 3, 5, 1, 2, 1, 1, 1
//	};
//
//	for (int i = 0; i < 30; i++) {
//		count[arr[i] - 1]++;
//	}
//
//	//각 갯수만큼 출력
//	for (int i = 0; i < 5; i++) {
//		if (count[i] != 0) {
//			for (int j = 0; j < count[i]; j++)
//				cout << i + 1 << " ";
//		}
//	}
//}